Autodesk.Revit.DB.TextNoteLeaderTypes
Types of text-note leaders

Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_ARC_R
An arc leader attached from the right side of a text element

Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_ARC_L
An arc leader attached from the left side of a text element

Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_STRAIGHT_R
A line leader attached from the right side of a text element

Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_STRAIGHT_L
A line leader attached from the left side of a text element